---
kind: method
id: M:Autodesk.Revit.DB.FaceSplitter.GetBoundaries
source: html/76a70892-c62f-f77d-18b6-eda50f2111da.htm
---
# Autodesk.Revit.DB.FaceSplitter.GetBoundaries Method

Gets the boundaries.

## Syntax (C#)
```csharp
public IList<CurveLoop> GetBoundaries()
```

## Returns
The face splitter boundaries.